In [1]:
import pandas as pd

In [2]:
e = pd.read_excel("exemple.xlsx")

In [3]:
e

        Nom   Prénom  Note 1  Note 2
0  Tremblay     Alex      16      12
1   Mestari  Ibrahim      13      16
2    Manjra     Sara      15      16

In [4]:
type(e)

pandas.core.frame.DataFrame

In [5]:
e["Note finale"]=(e["Note 1"]+e["Note 2"])/2
e

        Nom   Prénom  Note 1  Note 2  Note finale
0  Tremblay     Alex      16      12         14.0
1   Mestari  Ibrahim      13      16         14.5
2    Manjra     Sara      15      16         15.5

In [6]:
e.to_excel("résultat.xlsx")

In [7]:
e1=pd.read_csv("exemple.csv")

In [8]:
e1

  Nom;Prénom;Note 1;Note 2
0      Tremblay;Alex;16;12
1    Mestari;Ibrahim;13;16
2        Manjra;Sara;15;16

In [9]:
e1=pd.read_csv("exemple.csv",sep=";")

In [10]:
e1

        Nom   Prénom  Note 1  Note 2
0  Tremblay     Alex      16      12
1   Mestari  Ibrahim      13      16
2    Manjra     Sara      15      16

In [11]:
import os

In [ ]:
os.getcwd()
os.listdir()
os.chdir()